{"documentList":[{"projectName":"Project Portfolio","text":"First single page application with Angular 5 and TypeScript. Simple design allows admin to upload projects and coursework to be viewed by users. Users are able to filter/sort/search/view the projects. https://github.com/johnsonj561/Project-Portfolio 1/1/2018  Project scaffolding generated by angular-cli Admin sessions tracked with JSON Web Tokens Express server and API running on Node.js MongoDB data storage Running on Amazon AWS EC2SPA SPA SPA Angular Angular Angular Node.js Node.js Node.js Express Express Express MongoDB MongoDB MongoDB TypeScript TypeScript TypeScript AWS AWS AWS Project Portfolio Project Portfolio Project Portfolio Project Portfolio Project Portfolio "},{"projectName":"K Means Document Summarization","text":"A 10 sentence summary was generated from an original document containing 850 sentences with machine learning techniques. Once pre-processed, Python's Natural Language Toolkit (NLTK) was used to cluster the document into 10 groups with the K Means Algorithm. From each of the 10 clusters, the centroid was identified and extracted through use of cosine similarity measurements. Finally, the 10 resulting sentences were combined to produce a 10 sentence document summary. https://github.com/johnsonj561/K-Means-Document-Summarization 12/1/2017 Information Retrieval Tokenize, stem, stop word each sentence Cluster sentences into 10 groups using K Means clustering by NLTK Calculate the cosine similarity matrix for all sentence pairs in a given cluster, yielding 10 matrices, 1 per cluster For each Cosine Similarity matrix, Sum scores of each row to determine which row (sentence) has highest similarity with the most documents Return the sentence from each cluster that has highest similarity with other sentences of the cluster (returned by step 5)  Combine all 10 resulting high similarity sentences into 1 paragraph, which is to become the summary Sort the summary's sentences in the order that they appear in the original document, to maintain positional relationships of original document Return summaryMachine Learning Machine Learning Machine Learning K Means K Means K Means Clustering Clustering Clustering Python Python Python NLTK NLTK NLTK Cosine Similarity Cosine Similarity Cosine Similarity K Means Document Summarization K Means Document Summarization K Means Document Summarization K Means Document Summarization K Means Document Summarization "},{"projectName":"Levenshtein Distance","text":"The Levensthein distance between 2 strings is the sum of operations required to transform s1 into s2. It is commonly referred to as the edit distance between two strings. Operations include: insert, delete, substitute. This implementation scores each operation equally, as 1 point. Some algorithms may choose to weight substitution as 2 points, as it technically includes a delete followed by an insert.\n\nThe edit distance calculation was implemented with Dynamic Programming to achieve quadratic time complexity. Dynamic programming is the process of breaking a complex problem up into sub-problems, solving the sub-problems, and then combining the solutions of the sub-problems to achieve optimal solution. A matrix can often be used to store/recall solutions of sub-problems already completed. https://github.com/johnsonj561/Levenshtein-Distance 1/19/2018 Natural Language Processing Dynamic programming methodology Quadratic time and space complexityJavaScript JavaScript JavaScript Natural Language Processing Natural Language Processing Natural Language Processing Edit Distance Edit Distance Edit Distance Levenshtein Distance Levenshtein Distance Levenshtein Distance Levenshtein Distance Levenshtein Distance "},{"projectName":"AngularJS Publish/Subscribe","text":"A simple implementation of the Publish/Subscribe pattern for AngularJS. This pattern is also referred to as Observer pattern. This service can be used as an alternative to AngularJS $broadcast/$emit/$on methods. https://github.com/johnsonj561/AngularJS-Publishing-Service 1/10/2018 undefined Publishing Service implements subscribe and notify methods Components subscribe to the publishing service, passing a channel key to listen on and a callback function Components call the Publishing Service's notify method with a channel key Publishing Service then fires all callback functions registered to the notify channelAngularJS AngularJS AngularJS JavaScript JavaScript JavaScript Design Pattern Design Pattern Design Pattern AngularJS Publish/Subscribe AngularJS Publish/Subscribe AngularJS Publish/Subscribe AngularJS Publish/Subscribe AngularJS Publish/Subscribe "},{"projectName":"Search & Classification API","text":"A final project for Information Retrieval that consists of Natural Language tool selection, research, and demo. As a JavaScript developer, I selected NPM package 'Natural' to implement search and text classification as a REST API. Natural's text pre-processing, TF-IDF calculation, and model serialization were utilized to build an index of web pages. The front facing application, implemented in AngularJS, allowed users to post URL's which would then be indexed on the backend. When user's post search queries, indexed documents are ranked using Cosine Similarity scoring. \n\nNatural's Naive Bayes classification model was trained on the 4 Universities Dataset and stored as JSON. User's are able to post a URL to the server for classification. The classifier then assigns a class of Student, Faculty, Project, or Course to the URL. Naive Bayes is a probabilistic machine learning method that outputs the most likely class, based off the evidence observed during training. https://github.com/johnsonj561/Search-and-Classification-With-Natural 12/1/2017 Information Retrieval Natural - natural language facility for Node.js, used for tokenization, stemming, and TF-IDF calculations Node.js Express server with RESP API Document term tf-idf matrices Query document cosine similarity AngularJS single page applicationJavaScript JavaScript JavaScript Search Search Search Classification Classification Classification AngularJS AngularJS AngularJS Node.js Node.js Node.js Express Express Express Natural Natural Natural Natural Language Processing Natural Language Processing Natural Language Processing Machine Learning Machine Learning Machine Learning Search & Classification API Search & Classification API Search & Classification API Search & Classification API Search & Classification API "},{"projectName":"WEKA Text Classification","text":"The Naïve Bayes and SVM classifiers were trained and tested with Weka using the provided data set containing both training and test data. Both models were tested using the document-word matrix generated by Weka's default StringToWordVector and the document-word matrix generated through custom StringToWordVector settings. The custom settings included a tf-idf transform and normalization. \n\nThe Support Vector Machine classifier out-performed the Naïve Bayes classifier, achieving an approximate 10% increase in test data classification accuracy.\n\nFull report available at Github URL. https://github.com/johnsonj561/Weka-Text-Classification 11/15/2017 Information Retrieval WEKA Naive Bayes Support Vector MachineMachine Learning Machine Learning Machine Learning Naive Bayes Naive Bayes Naive Bayes SVM SVM SVM Classification Classification Classification WEKA WEKA WEKA WEKA Text Classification WEKA Text Classification WEKA Text Classification WEKA Text Classification WEKA Text Classification "},{"projectName":"Modular Exponentiation Performance","text":"Modular exponentiation is a type of exponentiation performed over a modulus, commonly used in field of cryptography. Calculates the remainder when an integer b (base) raised to the eth power (exponent) is divided by a positive integer m (the modulus):\n\nmodExp = (b^e) % m\n\nDepending on size of int, b^e will overflow relatively quickly\n\nIn Python, integers have arbitrary precision, allowing us to represent an arbitrarily large range of integers that is only limited by available memory. In other languages, like C or C++, overflow requires more attention.\n\nWe can avoid potential overflow and improve memory efficiency through use of following equivalency: if c = a * b then c mod m = (a * b) mod m = [(a mod m) * (b mod m)] mod m\n\n3 modular exponentiation algorithms are described and implemented on github. https://github.com/johnsonj561/Modular-Exponentiation-Performance 10/08/2017 Theory and Philosophy of Computation Implemented with Python Recursion used to improve performancePython Python Python Complexity Complexity Complexity Performance Performance Performance Modular Exponentiation Performance Modular Exponentiation Performance Modular Exponentiation Performance Modular Exponentiation Performance Modular Exponentiation Performance "},{"projectName":"Boolean Search in JavaScript","text":"A simple boolean search application that indexes documents as an inverted index with term frequencies. All text pre-processing, indexing, and search algorithms were implemented as JavaScript modules, no 3rd party libraries were used in the information retrieval process. https://github.com/johnsonj561/IR-Boolean-Search 9/28/2017 Information Retrieval Documents are read from collection directory Minimal text pre-processing is applied to each document (lowercase, remove whitespace, remove punctuation) Documents are tokenized, constructing a term list for each document (term, frequency) Inverted index is created such that inverted index includes list of all terms found in collection Each term in index points to a postings list, a list of documents that contain the term and the frequency of the term in given document Application enters prompt loop, requesting search term from user and providing results until terminatesJavaScript JavaScript JavaScript Information Retrieval Information Retrieval Information Retrieval Natural Language Processing Natural Language Processing Natural Language Processing Boolean Search in JavaScript Boolean Search in JavaScript Boolean Search in JavaScript Boolean Search in JavaScript Boolean Search in JavaScript "},{"projectName":"Cosine Similarty in Python","text":"A python application that reads a collection of documents, applies text pre-processing and cleaning, then calculates all document vs document similarity scores using cosine similarity. There is a full project report, CAP6776-Assignment1-jjohn273.pdf, that can be found on github. https://github.com/johnsonj561/IR-Python-Cosine-Similarity 9/28/2017 Information Retrieval Read collection of text documents, tokenize, remove stop words, and apply Porter Stemming Calculate document frequency and inverse document frequency Construct a term - document tf-idf matrix Calculate cosine similarity for each pair of documents, output results as matrix Utilize Scikit-learn's cosine similarity function to validate results from previous stepPython Python Python Scikit-learn Scikit-learn Scikit-learn Natural Language Processing Natural Language Processing Natural Language Processing Cosine Similarity Cosine Similarity Cosine Similarity Cosine Similarty in Python Cosine Similarty in Python Cosine Similarty in Python Cosine Similarty in Python Cosine Similarty in Python "},{"projectName":"KB Software Solutions","text":"Website development business owned and operated between 2015 - 2017. The business provided a means for obtaining web dev experience and additional funding for college. Responsive websites were provided to over a dozen small businesses. https://github.com/johnsonj561/KB-Software-Solutions 7/01/2015 undefined LAMP stack hosted with GoDaddy Custom websites built with Bootstrap Wordpress web sites and blogs Google analytics SEO best practicesHTML HTML HTML CSS CSS CSS JavaScript JavaScript JavaScript jQuery jQuery jQuery PHP PHP PHP MySQL MySQL MySQL Bootstrap Bootstrap Bootstrap KB Software Solutions KB Software Solutions KB Software Solutions KB Software Solutions KB Software Solutions "},{"projectName":"My Training Page","text":"Web application that allows employers to rapidly train their employees in the cloud. Implemented with MEAN Stack on AWS. Admin users are able to Edit employee profiles and permissions, generate custom training modules, assign training modules to employees, and view employee/training module reports. User use cases include: Register account, edit profile, wiew training modules assigned by admin, complete training modules assigned by admin, view training reports and stats. The project readme.md found on github includes a use case diagram and design mockup. https://github.com/johnsonj561/My-Training-Page 5/15/2017 Semantic Web Applications AngularJS front end single page application Node.js Express back end and REST API User authentication with JSON Web Tokens MongoDB and mongoose used for storageAngularJS AngularJS AngularJS JavaScript JavaScript JavaScript Node.js Node.js Node.js Express Express Express MongoDB MongoDB MongoDB SPA SPA SPA JWT JWT JWT AWS AWS AWS My Training Page My Training Page My Training Page My Training Page My Training Page "},{"projectName":"Image Classifier with Matlab","text":"A pre-trained convolutional neural net, AlexNet, is used to extract features from the data set. Beginning with 100 observations from the Kaggle data set, and increasing to 1000 observations, Discriminant Analysis and the Support Vector Machine are used to generate models using the features that were extracted from the AlexNet CNN. Additionally, image pre-processing filters are applied to detect changes in overall accuracy.  https://github.com/johnsonj561/Cat-Dog-Classification 3/05/2017 Intro Artificial Intelligence Image pre-processing Feature extraction with convolutional neural network, AlexNet Prediction models generated with discriminant analysis, cross validation accuracy of 92% achieved Matlab Matlab Matlab Machine Learning Machine Learning Machine Learning Image Processing Image Processing Image Processing SVM SVM SVM Neural Network Neural Network Neural Network Kagle Kagle Kagle Image Classifier with Matlab Image Classifier with Matlab Image Classifier with Matlab Image Classifier with Matlab Image Classifier with Matlab "},{"projectName":"Color Sorting System","text":"A system was designed to separate red, green, and blue cubes as they travelled along a conveyor belt. The conveyor belt was constructed with 3D printed parts, DC motors, and an Arduino controller. The belt included a tunnel that colored cubes would travel through, and at the end of the tunnel was a swing arm capable of pushing items off the belt, to the left or the right. A flashing LED and photo-resistor was used to detect items in the tunnel. Once an object was detected - reg, green, and blue LEDs were flashed while simultaneously recording photo-resistor responses. The Arduino could calculate the color of the cube by analyzing photo-resistor values, because the amount of light reflected off the cube would depend on the color of the light. Once the color was confirmed, the conveyor belt would start again, carrying the cube to the end of the tunnel. At this time, the swing arm would push the cube into the left/right bins, or allow the cube to fall straight into the center bin.  https://github.com/johnsonj561/ED1-Mini-Project/tree/master/ed-mini-project-v4 6/05/2016 Senior Engineering Design ArduinoArduino Arduino Arduino C++ C++ C++ Embedded System Embedded System Embedded System 3D Printing 3D Printing 3D Printing Color Sorting System Color Sorting System Color Sorting System Color Sorting System Color Sorting System "},{"projectName":"Pick & Place Machine","text":"The PIC n Place machine was designed and built by Sam Rosenfield (electrical), Stephen Lyons (mechanical), and Justin Johnson (programmer) in Fall of 2016 as a Senior design project. The machine utilizes a vacuum nozzle to pick up surface mount components, move them about the workspace, and place them accurately onto printed circuit boards. This is accomplished with 4 degrees of movement - X, Y, Z, and rotation. Computer vision libraries are used to increase accuracy and improve performance. All aspects of the machine were implemented from the ground up with completely custom PCB Design and Software.\n\nMy responsibility included implementation of PC User Interface (Java), and the Computer Vision Error Detection system (Python/OpenCV): https://github.com/johnsonj561/PNP-UI 11/01/2016 Senior Engineering Design Connecting to machine's embedded controller over USB Serial communication to send G-Code instructions to machine and parse machine feedback Manually controlling machine axes with UI Jog Controls Parsing PCB Design input files to generate G-Code commands capable of automating part placement Defining SMT part reels and locations on workspace to allow for full placement automation Processing batch jobs of G-Code while providing user feedback through interface and log files Utilizing OpenCV Computer Vision library to detect proper alignment of larger components before being placed PC User Interface implemented with Java Computer Vision Error Detection implemented in Python with OpenCV computer vision libraryJava Java Java Python Python Python Computer Vision Computer Vision Computer Vision OpenCV OpenCV OpenCV Pick & Place Machine Pick & Place Machine Pick & Place Machine Pick & Place Machine Pick & Place Machine "},{"projectName":"Bluetooth Smart Feeder","text":"The Bluetooth Smart Feeder was created in 2015 for a FAU Embedded System's course project. The feeder, powered by the MSP430 micro-controller, contains various sensors that detect available food supplies and dispense food to the bowl to be eaten. The feeder uses a pressure sensor to determine how much food is present in the bowl. This information is then communicated to the user's mobile phone over bluetooth. The system also includes object recognition that will prevent the dispensing of food when an animal is eating, preventing the system from potentially harming a pet. The mobile phone application allows users to view the feeder's available food supply and dispense additional food by activating the system's motor. The mobile phone application was written in Java using the Android SDK. https://github.com/johnsonj561/Android-Bluetooth-V2 11/15/2015 Intro Embedded Systems MSP430 Project - https://github.com/johnsonj561/MSP430-Bluetooth-Smart-Feeder Android Application - https://github.com/johnsonj561/Android-Bluetooth-V2Android Android Android Java Java Java Android SDK Android SDK Android SDK Bluetooth Bluetooth Bluetooth MSP430 MSP430 MSP430 Bluetooth Smart Feeder Bluetooth Smart Feeder Bluetooth Smart Feeder Bluetooth Smart Feeder Bluetooth Smart Feeder "},{"projectName":"Route Scheduling Web App","text":"The Meals On Wheels Delivery &amp; Routing Services is a web application developed on the LAMP stack. The application provides functionality for both Meals On Wheels employees and their drivers - allowing drivers to create delivery schedules, generate optimal delivery routes using Google Map API, and launch navigation services that will take the driver to their stops. https://github.com/johnsonj561/Meals-On-Wheels 10/01/2014 Intro Internet Computing HTML HTML HTML CSS CSS CSS JavaScript JavaScript JavaScript PHP PHP PHP MySQL MySQL MySQL Route Scheduling Web App Route Scheduling Web App Route Scheduling Web App Route Scheduling Web App Route Scheduling Web App "},{"projectName":"Photo Signature Android App","text":"An Android application that allows users to take photos, then apply signatures or draw pictures on top of the image. Once complete, images can be saved to the device or shared with others. https://github.com/johnsonj561/Celeb-Selfies 6/13/2015 undefined Android Android Android Java Java Java Android SDK Android SDK Android SDK Photo Signature Android App Photo Signature Android App Photo Signature Android App Photo Signature Android App Photo Signature Android App "}]}
